from dotenv import load_dotenv
from aiogram.utils.markdown import hlink
import os
import random

# load data from .env
load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")

father_id = 905143300
sticker_uid_values = {
    "AQADpwsAAo1TYEly" : 10,
    "AQADVgsAAvl0aEly" : 50,
    "AQAD6w8AApJ2YUly" : -10,
    "AQAD8gsAAuATYUly" : -50
}

database_settings = {
    "host" : os.getenv("db_h"),
    "user" : os.getenv("db_u"),
    "password" : os.getenv("db_pwd"),
    "database" : os.getenv("db_db")
}

help_text = f"""Привіт я <b>{'Дія.Рейтинг'}</b> бот, я рахую рейтинг учасників в чаті.

Щоб повисити/понизити рейтинг учасника зроби на його повідомлення (reply) і вибери з {hlink('стікерпаку', 'https://t.me/addstickers/DiiaRating')} Дії бал на який ти хочеш оцінити свого співрозмовника.

Доступні команди:
/help — Правила користування ботом
/top — Вивести топ всіх учасників по рейтингу
/rating — Вивести свій рейтинг

Я працюю в будь-яких групах, тому ти можеш добавити мене кудись ще"""

def status_text(rating):
    if 10 <= rating < 50: return random.choice(
        [
            "Додаткова миска борщу гарантована!",
            "Вам надано знижку до хлібу \"Сумська паляниця\"!",
            "Слава Україні!"
        ]
    )
    elif 50 <= rating < 100: return random.choice(
        [
            "Безкоштовне сало й миска борщу в подарунок!",
            "Подяка від ТрО Закарпаття. Вам видано комплект силової броні!",
            "Вам надана грамота від голови Чорнобаївської сільської громади!",
            "Вам надано знижку до путівки в Трускавець!",
            "Слава Україні!"
        ]
    )
    elif 100 <= rating < 500: return random.choice(
        [
            "Подяка від президента. Вам надана путівка в Букавель!",
            "Кличко запрошує Вас до мерії!",
            "Приват24 більше не буде дзвонити до Вас!",
            "Вам привезли херсонський кавун!",
            "Вам надана знижка на Кобзар!",
            "Слава Україні!"
        ]
    )
    elif 500 <= rating < 700: return random.choice(
        [
            "Вам надана безкоштовна порція смачних голубців!",
            "Грузовик з паляницями вже біля Вашого дому!",
            "Залужний Валерій Федорович хоче потиснути Вам руку!",
            "Ваша стипендія збільшилась на 1000 грн!",
            "Арестович Вас поважає!",
            "Слава Україні!"
        ]
    )
    elif 700 <= rating < 1000: return random.choice(
        [
            "Ви попрацювали як заспокійлеве від Арестовича!",
            "Ви попрацювали як заспокійлеве від Гіркіна-Сртрєлкова!",
            "Висловлення подяки від Служби Безпеки України!",
            "Вас починають боятися в кремлі!",
            "Вам везуть найбільший херсонський кавун!",
            "Слава Україні!"
        ]
    )
    elif 1000 <= rating < 1488: return random.choice(
        [
            "Вам передано депутатський мандат від партії \"Слуга Народу\"!",
            "Вам надан орден \"За заслуги\"!",
            "путін Вас боїться!",
            "Вам надано автомат з вишмату!",
            "Хлопці з ФІОТу в КПІ цікавляться Вами!",
            "Кицькожінки цікавляться Вами!"
            "Слава Україні!"
        ]
    )
    elif 1488 <= rating < 2000: return random.choice(
        [
            "Книга \"Моя Боротьба\" додана до вашої онлайн-бібліотеки!",
            "Маніфест \"Самостійна Україна\" додана до вашої онлайн-бібліотеки!",
            "Президент України запрошує Вас повечеряти!",
            "кремль Вас не любить!",
            "Макрон заздрить Вам!",
            "Слава Україні!"
        ]
    )
    elif 2000 <= rating < 5000: return random.choice(
        [
            "Вам довірено плани по звільненню Білгородської області!",
            "Вам довірено плани по звільненню Кубанської області!",
            "На Ваше ім'я названо вулицю в центрі Київа!",
            "Вам надано орден Держави!",
            "В КПІ про Вас складають легенди!",
            "Слава Україні!"
        ]
    )
    elif 5000 <= rating < 8000: return random.choice([
            "Ви права рука Головнокомандувача Юрія Ткача по звільненню Курська",
            "Пес Патрон біля Вашого дому!",
            "Вам дозволено купити ПТРК \"Nlav\" і \"Javelin\"!",
            "Херсонські цигани везуть Вам танк!",
            "Тарас Григорович Шевченко пишається Вами!",
            "Слава Україні!"
    ])
    elif rating >= 8000: return random.choice([
        "Ви стали радником Офісу Президента! Слава Україні!",
        "Вам надано звання Героя України! Слава Україні!",
        "Ми пишаємося Вами! Слава Україні!",
        "Вам надано керування БПЛА \"Bayraktar TB2\"!",
        "Ви зареєстровані в e-чергу з двома гарними кицькожінками!"
    ])
    if -50 < rating <= -10: return random.choice(
        [
            "Додаткові порції борщу НЕ БУДЕ!",
            "Вартість проїздних квитків для Вас збільшилася на 0.5 грн!",
            "Слава Україні!"
        ]
    )
    elif -100 < rating <= -50: return random.choice(
        [
            "Кицькожінка пішла від Вас, а якщо її не було, то і не буде!",
            "Вас не любить Укрзалізниця!",
            "Ціна на паляницю для вас збільшилась!",
            "Слава Україні!"
        ]
    )
    elif -500 < rating <= -100: return random.choice(
        [
            "Ви засмутили ГенШтаб, Вам видана поїздка під Ізюм!",
            "Арестович засудив Вас!",
            "Вас недолюблюють в КПІ!",
            "Слава Україні!"
        ]
    )
    elif -700 < rating <= -500: return random.choice(
        [
            "Більше ніякого сала з часником НЕ БУДЕ!",
            "Вам запретили купувати кавуни!",
            "На допку!",
            "Кличко визиває Вас на ринг!",
            "Слава Україні!"
        ]
    )
    elif -1000 < rating <= -700: return random.choice(
        [
            "Ви нагадуєте диверсанта, очікуйте гостей з ТрО Вашого міста!",
            "Вас засудив Президент України!",
            "путін почав цікавитися Вами!",
            "Залужний Вас недолюблює!",
            "Вас буде прив'язано до стовпа і відлупцьовано вербою!",
            "Слава Україні!"
        ]
    )
    elif -1488 < rating <= -1000: return random.choice(
        [
            "Очікуйте на бан! Надалі без коментарів",
            "Ви нас засмутили!",
            "В росії Вас оголосили героєм дрн і лнр!",
            "Біля Вашого входу стоять силовики!",
            "Відрахування!"
        ]
    )
    elif -2000 < rating <= -1488: return random.choice(
        [
            "Ви порушили статтю 436-І ККУ очікуйте на патруль!",
            "В ООН планують ввести на Вас санкції!",
            "путін запрошує Вас до себе!",
            "Студенти КПІ Вас хейтять!"
        ]
    )
    elif rating <= -2000: return random.choice(
        [
            "До вас виїхали! Не намагайтеся чинити опір!",
            "Над вашою хатою літає Байрактар!",
            "Ми засуджуємо вас!",
            "Не рухайтесь! Снайпери самі все за вас зроблять!",
            "Вигляніть в вікно і не рухайтесь!"
            "вас оголошено ворогом України!"
        ]
    )
