import random
def status_text(rating):
    if 10 <= rating < 50: return random.choice([
        "Додаткова миска борщу гарантована!",
        "Вам надано знижку до хлібу \"Сумська паляниця\"!",
        "+2 гігабайти до Вашого мобільного інтернету!",
        "Надано безкошковний квиток в метро!",
        "Слава Україні!"
    ])
    elif 50 <= rating < 100: return random.choice([
        "Безкоштовне сало й миска борщу в подарунок!",
        "Вам надана грамота від голови Чорнобаївської сільської громади!",
        "Вам надано знижку до путівки в Трускавець!",
        "Вам надано сральний сертифікат!",
        "Кур'єр везе вам лоток яєць!",
        "Слава Україні!"
    ])
    elif 100 <= rating < 500: return random.choice([
        "Вам надана путівка в Буковель!",
        "Приват24 більше не буде дзвонити до Вас!",
        "Вам привезли херсонський кавун!",
        "Вам надана знижка на Кобзар!",
        "Ваш сральний сертифікат підтверджено!",
        "Ви стали бійцем кавунячої армії!",
        "Вам надано звання \"Рядовий бази\"",
        "Слава Україні!"
    ])
    elif 500 <= rating < 700: return random.choice([
        "Вам надана безкоштовна порція смачних голубців!",
        "Ящик з паляницями вже біля Вашого дому!",
        "Орел хоче потиснути Вам руку!",
        "Подяка від ТрО Закарпаття. Вам видано комплект силової броні!",
        "Ваша стипендія збільшилась на 250 грн!",
        "КПІМедіа запрошує Вас на інтервю!",
        "Слава Україні!"
    ])
    elif 700 <= rating < 1000: return random.choice([
        "6 рулонів туалетного паперу з путіним вже біля Вашого входу",
        "Безкоштовна доставка по Нова Пошта",
        "Вам везуть мішок херсонських кавунів!",
        "Вам везуть легендарну мівіну!",
        "Вам везуть гуманітарку з Тайваню!",
        "Знижка 20% в Пузатій Хаті!",
        "Слава Україні!"
    ])
    elif 1000 <= rating < 1488: return random.choice([
        "В КПІ про Вас складають легенди!",
        "Хлопці з ФІОТу в КПІ цікавляться Вами!",
        "Кличко запрошує Вас на свій міст!",
        "Вам надано сертифікат на 10000 грн!",
        "В кремлі складають чутки про вас!",
        "\"Перспективи Української Революції\" Степана Бандери вже у Вашій онлайн-бібліотеці!",
        "Корнага пишається Вами!",
        "Вам надано звання \"Сержант бази\"!",
        "Слава Україні!"
    ])
    elif 1488 <= rating < 2000: return random.choice([
        "Книга \"Моя Боротьба\" додана до вашої онлайн-бібліотеки!",
        "Маніфест \"Самостійна Україна\" додана до вашої онлайн-бібліотеки!",
        "В КПІ про Вас складають легенди!",
        "соловйов хейтить Вас!",
        "Вам надано звання \"Лейтенант бази\"",      
        "Вам надано автомат з вишмату!",       
        "Слава Україні!"
    ])
    elif 2000 <= rating < 3500: return random.choice([
        "Кицькодівчата цікавляться Вами!",
        "Вам надано звання \"Майор бази\"", 
        "Вам везуть мегакавун!",
        "Вам наданий Telegram Premium!",
        "Ковальов Вас поважає!",
        "Висловлення подяки від Служби Безпеки України!",
        "Президент дозволив Вам срати!",
        "1+1 хоче взяти у Вас інтерв'ю!",
        "Слава Україні!"
    ])
    elif 3500 <= rating < 5000: return random.choice([
        "Вам надано кицькодівчину, робіть з нею все що хочете!",
        "Кур'єр везе Вам браслетик з Азовсталі!",
        "Ви попрацювали як заспокійливе для Арестовича!",
        "Вам надано звання \"Полковник бази\"", 
        "Грузовик з кавунами вже біля Вашого дому!",  
        "Лукашенко складає план по вбивству Вас, будьте обережні!",   
        "Кличко запрошує Вас до мерії!",
        "Арестович поважає Вас!",
        "Слава Україні!"
    ])
    
    elif 5000 <= rating < 8000: return random.choice([  
        "Вам надано орден \"Генерал бази\"", 
        "В росії Вас оголосили ворогом народу!",
        "Пес Патрон біля Вашого дому!",
        "Вам видано новенький ПТРК \"Nlav\" і \"Javelin\"!",
        "путін хейтить Вас!",        
        "Ви права рука Головнокомандувача Юрія Ткача по звільненню Кубані",
        "Вам передано депутатський мандат від партії \"Слуга Народу\"!",
        "Слава Україні!"
    ])
    elif 8000 <= rating < 10000: return random.choice([
        "Макрон заздрить Вам!",
        "путін Вас боїться!",
        "Херсонські цигани везуть Вам танк!",
        "Залужний Валерій Федорович пишається Вами!",
        "Вам надано плани плани по звільненню Білгородської області!",
        "Президент запрошує Вас повечеряти!",
        "Слава Україні!"
    ])
    elif rating >= 10000: return random.choice([
        "Ви стали радником Офісу Президента! Слава Україні!",
        "Вам надано звання Героя України! Слава Україні!",
        "Ми пишаємося Вами! Слава Україні!",
        "Вам надано керування БПЛА \"Bayraktar TB2\"!",
        "Ви зареєстровані в e-чергу з двома гарними кицькожінками!",
        "Слава Україні!"
    ])
    if -50 < rating <= -10: return random.choice([
        "Додаткові порції борщу НЕ БУДЕ!",
        "Вартість проїздних квитків для Вас збільшилася на 0.5 грн!",
        "-1 гігабайт з Вашого мобільного інтернету!",
        "Слава Україні!"
    ])
    elif -100 < rating <= -50: return random.choice([
        "Більше ніяких знижок в від студенського для Вас!",
        "Ціна на паляницю для вас збільшилась!",
        "Слава Україні!"
    ])
    elif -500 < rating <= -100: return random.choice([
        "Київстар буде спамити Вам повідомлення!",
        "Ви засмутили ГенШтаб, Вам видана поїздка під Ізюм!",
        "Вас недолюблюють в КПІ!",
        "Слава Україні!"
    ])
    elif -700 < rating <= -500: return random.choice(
        [
            "Кицькожінка пішла від Вас, а якщо її не було, то і не буде!",
            "Більше ніякого сала з часником НЕ БУДЕ!",
            "Вам запретили купувати кавуни!",
            "На допку!",
            "Кличко визиває Вас на ринг!",
            "Слава Україні!"
        ]
    )
    elif -1000 < rating <= -700: return random.choice([
            "Вас не любить Укрзалізниця!",
            "Арестович засудив Вас!",
            "Ви нагадуєте диверсанта, очікуйте гостей з ТрО Вашого міста!",
            "Вас засудив Президент України!",
            "путін почав цікавитися Вами!",
            "Залужний Вас недолюблює!",
            "Вас буде прив'язано до стовпа і відлупцьовано вербою!",
            "Слава Україні!"
    ])
    elif -1488 < rating <= -1000: return random.choice([
            "Очікуйте на бан! Надалі без коментарів",
            "Ви нас засмутили!",
            "В росії Вас оголосили героєм дрн і лнр!",
            "Біля Вашого входу стоять силовики!",
            "Відрахування!"
    ])
    elif -2000 < rating <= -1488: return random.choice([
            "Ви порушили статтю 436-І ККУ очікуйте на патруль!",
            "В ООН планують ввести на Вас санкції!",
            "путін запрошує Вас до себе!",
            "Студенти КПІ Вас хейтять!"
    ])
    elif rating <= -2000: return random.choice([
            "До вас виїхали! Не намагайтеся чинити опір!",
            "Над вашою хатою літає Байрактар!",
            "Ми засуджуємо вас!",
            "Не рухайтесь! Снайпери самі все за вас зроблять!",
            "Вигляніть в вікно і не рухайтесь!",
            "вас оголошено ворогом України!"
    ])
    else: return "Ви нічого не заслужили"